
Функция ПодключитьсяКбазе(Структура) Экспорт
	
	СтрокаПодключения = "Srvr="+Структура.Сервер+"; Ref="+Структура.База+"; Usr="+Структура.Пользователь+"; Pwd="+Структура.Пароль+";";
	ПараметрыПодключенияКлиентСервернойИБ = СтрокаПодключения;
	//"Srvr=serv1c; Ref=buh_51346332; Usr=roman; Pwd=roman;";
	
	V83COMCon = Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMCon.Connect(ПараметрыПодключенияКлиентСервернойИБ);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции 

Процедура ЗаполнитьРеквизитыОбъекта(Ссылка) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.рс_Реквизиты.Очистить(); 
		
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, Строка(СпрОбъект.Вид));
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.рс_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено);
	
	ЗаполнитьРеквизиты(Структура); 
	
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ = Метаданное.Имя;
		ТабЧасть =  Справочники.рс_ТабличнаяЧасть.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = Создать_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизиты(Структура);
	КонецЦикла;	
	
	СпрОбъект.Записать();
		
КонецПроцедуры     

Процедура ЗаполнитьРеквизиты(Структура) Экспорт 

	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].Реквизиты Цикл 
		НовСтрока = Структура.Табл.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;
		
		Если Не Структура.ТЧ = Неопределено Тогда 
			НовСтрока.рс_ТабличнаяЧасть = Структура.ТЧ;
		КонецЕсли;	
		
		ТипыР = Метаданное.Тип.Типы();
		ТипР = "";
		Для Каждого стрТип Из ТипыР Цикл
			ПоискТип = Метаданные.НайтиПоТипу(стрТип);
			Если ПоискТип = Неопределено Тогда 
				РеквизитТип 		= Метаданное.Тип;	
			Иначе 	
				ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
				РеквизитТип = ТипР;		
			КонецЕсли;
		КонецЦикла;
		
		НовСтрока.РеквизитТип 			= РеквизитТип; 		 
		НовСтрока.ПроверкаЗаполнения 	= Метаданное.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку; 			
	
	КонецЦикла;

КонецПроцедуры

Функция Создать_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.рс_ТабличнаяЧасть.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_ТабличнаяЧасть.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
КонецФункции

