
//Структура 
//Структура "Сервер"			,ИмяСервера);
//Структура "База"				,ИмяБазы);
//Структура "Пользователь"		,ИмяПользователя);
//Структура "Пароль"			,Пароль);
//
Функция ПодключитьсяКбазе(Структура) Экспорт
	
	СтрокаПодключения = "Srvr="+Структура.Сервер+"; Ref="+Структура.База+"; Usr="+Структура.Пользователь+"; Pwd="+Структура.Пароль+";";
	ПараметрыПодключенияКлиентСервернойИБ = СтрокаПодключения;
	//"Srvr=serv1c; Ref=buh_51346332; Usr=roman; Pwd=roman;";
	
	V83COMCon = Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMCon.Connect(ПараметрыПодключенияКлиентСервернойИБ);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции 

Функция ПодключитьсяКТекущейбазе(Ссылка) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Сервер"			,Ссылка.ИмяСервера);
	Структура.Вставить("База"			,Ссылка.ИмяБазы);
	Структура.Вставить("Пользователь"	,Ссылка.ИмяПользователя);
	Структура.Вставить("Пароль"			,Ссылка.Пароль);
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКбазе(Структура);  
	
	Возврат Соединение;
КонецФункции

//Ссылка - Ссылка на Объект
//ИБ 	 - СОМ соединение
//
Процедура ЗаполнитьРеквизитыОбъекта(Ссылка, ИБ) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.рс_Реквизиты.Очистить(); 
	
	Соединение = ПодключитьсяКТекущейбазе(ИБ);
	
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, Строка(СпрОбъект.Вид));
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.рс_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено); 
	Структура.Вставить("ИБ"		, Соединение);
	
	ЗаполнитьРеквизиты(Структура); 
	
	Для Каждого Метаданное Из Соединение.Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ = Метаданное.Имя;
		ТабЧасть =  Справочники.рс_ТабличнаяЧасть.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = Создать_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизиты(Структура);
	КонецЦикла;	
	
	СпрОбъект.Записать();
		
КонецПроцедуры     

//	Структура "тВид"	, Строка(СпрОбъект.Вид));
//	Структура "ИД"		, СпрОбъект.Индентификатор);
//	Структура "Табл"	, СпрОбъект.рс_Реквизиты);
//	Структура "ТЧ"		, Неопределено); 
//	Структура "ИБ"		, ИБ);
//
Процедура ЗаполнитьРеквизиты(Структура) Экспорт 
     ИБ = Структура.ИБ; 
	 
	Для Каждого Метаданное Из ИБ.Метаданные[Структура.тВид][Структура.ИД].Реквизиты Цикл 
		НовСтрока = Структура.Табл.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;
		
		Если Не Структура.ТЧ = Неопределено Тогда 
			НовСтрока.рс_ТабличнаяЧасть = Структура.ТЧ;
		КонецЕсли;	
		
		ТипыР = Метаданное.Тип.Типы(); 
		ТипР = "";
		
		//--Временно пока не понятно как--
		//
		//Для Каждого стрТип Из ТипыР Цикл 			
		//	ПоискТип = Метаданные.НайтиПоТипу(стрТип);
		//	Если ПоискТип = Неопределено Тогда 
		//		РеквизитТип 		= Метаданное.Тип;	
		//	Иначе 	
		//		ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
		//		РеквизитТип = ТипР;		
		//	КонецЕсли;
		//КонецЦикла;
		//
		//НовСтрока.РеквизитТип 			= РеквизитТип; 		 
		НовСтрока.ПроверкаЗаполнения 	= Метаданное.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку; 			
	
	КонецЦикла;

КонецПроцедуры

Функция Создать_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.рс_ТабличнаяЧасть.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_ТабличнаяЧасть.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка; 
	 
 КонецФункции
 
Функция НайтиСправочникОбъект(Наименование) Экспорт
	
	СправочникСсылка = Справочники.рс_Объекты.ПустаяСсылка();
	
	 СправочникСсылка = Справочники.рс_Объекты.НайтиПоНаименованию(Наименование);
	
	Возврат СправочникСсылка; 
	
КонецФункции	 

Функция НайтиОбъект(Тип, Наименование) Экспорт
	
	Если Тип = "Catalogs" Тогда 
		 Вид = Перечисления.рс_ВидОбъектов.Справочники;
	КонецЕсли;
	
	СправочникСсылка = Справочники.рс_Объекты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рс_Объекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.рс_Объекты КАК рс_Объекты
		|ГДЕ
		|	рс_Объекты.Вид = &Вид
		|	И рс_Объекты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Вид", Вид);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
		
	Возврат СправочникСсылка; 
	
КонецФункции

Функция СоздатьОбъект(Структура)  Экспорт 
	
	Нов_Объект = Справочники.рс_Объекты.СоздатьЭлемент();	
	Нов_Объект.Индентификатор 		= Структура.Индентификатор;
	Нов_Объект.Наименование  		= Структура.Наименование; 
	Нов_Объект.Вид            		= Структура.Вид;
	Нов_Объект.Подсистема     		= Структура.Подсистема;
	Нов_Объект.ИнформационнаяБаза 	= Структура.СправочникИБ;
	
	Нов_Объект.Записать();
	
	ЗаполнитьРеквизитыОбъекта(Нов_Объект.Ссылка, Структура.ИнформационнаяБаза);

	Возврат Нов_Объект.Ссылка;
	
КонецФункции 
