
Функция ПодключитьсяКбазе(Структура) Экспорт
	
	СтрокаПодключения = "Srvr="+Структура.Сервер+"; Ref="+Структура.База+"; Usr="+Структура.Пользователь+"; Pwd="+Структура.Пароль+";";
	ПараметрыПодключенияКлиентСервернойИБ = СтрокаПодключения;
	//"Srvr=serv1c; Ref=buh_51346332; Usr=roman; Pwd=roman;";
	
	V83COMCon = Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMCon.Connect(ПараметрыПодключенияКлиентСервернойИБ);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
