
&НаСервере 
//
//
Процедура КомандаЗаполнитьНаСервере() 
	
	//ИБ = 
	
	ОбщийМодульСервер.ЗаполнитьРеквизитыОбъекта(Объект.Ссылка, Объект.ИнформационнаяБаза); 
	
КонецПроцедуры

&НаКлиенте 
//КомандаЗаполнить
//
Процедура КомандаЗаполнить(Команда) 
	
	КомандаЗаполнитьНаСервере();
	
	ЭтаФорма.Прочитать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедурыФункцииПриАктивизацииСтроки(Элемент) 
	//Если Объект.ПроцедурыФункции.Количество() > 0 Тогда 
	//	СпрСсылка = Элементы.ПроцедурыФункции.ТекущиеДанные.Наименование;
	//	ЗаполнитьОписаниеТекстомФункции(СпрСсылка);
	//КонецЕсли;
КонецПроцедуры  

 &НаСервере
 Процедура ЗаполнитьОписаниеТекстомФункции(СпрСсылка)
	 
	 Объект.Описание =   СпрСсылка.ТекстМодуля;
	 
КонецПроцедуры	 

