
&НаКлиенте
Процедура НомерМажорПриИзменении(Элемент)
	СформироватьНомер();
КонецПроцедуры

&НаСервере
Процедура СформироватьНомер()
	Объект.Номер = Объект.НомерМажор + "." + Объект.НомерМинор;	
КонецПроцедуры	

&НаКлиенте
Процедура НомерМинорПриИзменении(Элемент)
	СформироватьНомер();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СформироватьНомер();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеАС_РеквизитНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	ДанныеВыбора = ДанныеВыбораРеквизита(Элементы.Описание.ТекущиеДанные.АС_Объект);  
	
КонецПроцедуры  

Функция ДанныеВыбораРеквизита(СправочникСсылка)
	
	ДанныеДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АС_ОбъектыАС_Реквизиты.АС_Реквизит КАК АС_Реквизит
		|ИЗ
		|	Справочник.АС_Объекты.АС_Реквизиты КАК АС_ОбъектыАС_Реквизиты
		|ГДЕ
		|	АС_ОбъектыАС_Реквизиты.Ссылка = &СправочникСсылка";
	
	Запрос.УстановитьПараметр("СправочникСсылка", СправочникСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДанныеДляВыбора.Добавить(ВыборкаДетальныеЗаписи.АС_Реквизит);
	КонецЦикла;
	
	Возврат ДанныеДляВыбора;
	
КонецФункции	
