&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МенюНаСервере();
КонецПроцедуры

&НаСервере
Процедура МенюНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет 			= ОбработкаОбъект.ПолучитьМакет("МакетМеню"); 
	ТекстHTML       = Макет.ПолучитьТекст();	
	ОсновнойТекст 	= ТекстHTML;   
	Элементы.ОсновнойТекст.Заголовок = "Меню"; 
КонецПроцедуры

&НаКлиенте
Процедура КомандаМеню(Команда)
	МенюНаСервере();   
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойТекстПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка) 
	ВнутренийТехт = ДанныеСобытия.Element.innerText;
	//Если ВнутренийТехт = "Бюджетирование" Тогда 
	//	ТекстHTML = БюджетированиеНаСервере();  
	//	Элементы.ОсновнойТекст.Документ.documentElement.innerHTML = "Бюджетирование";
	//	ОсновнойТекст 	= ТекстHTML;   
	//	Элементы.ОсновнойТекст.Заголовок = "Бюджетирование";
	//ИначеЕсли ВнутренийТехт = "Давальческое сырье" Тогда 
	//	ТекстHTML = ДавальческоеСырьеНаСервере();  
	//	Элементы.ОсновнойТекст.Документ.documentElement.innerHTML = "Давальческое сырье";
	//	ОсновнойТекст 	= ТекстHTML;   
	//	Элементы.ОсновнойТекст.Заголовок = "Давальческое сырье";
	//КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция БюджетированиеНаСервере()
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//Макет 			= ОбработкаОбъект.ПолучитьМакет("МакетБюджетирование"); 
	//ТекстHTML       = Макет.ПолучитьТекст();
	//
	//Возврат ТекстHTML;
КонецФункции 



