
&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Структура = Новый Структура;
	Структура.Вставить("Сервер"			,Объект.ИмяСервера);
	Структура.Вставить("База"			,Объект.ИмяБазы);
	Структура.Вставить("Пользователь"	,Объект.ИмяПользователя);
	Структура.Вставить("Пароль"			,Объект.Пароль);
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКбазе(Структура);    
	Если Не Соединение = Неопределено Тогда 
		 Объект.НазваниеВерсияКонфигурации =  Соединение.Метаданные.BriefInformation + " " + Соединение.Метаданные.Version;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	Объект.рс_Метаданные.Очистить();
	
	Структура = Новый Структура;
	Структура.Вставить("Сервер"			,Объект.ИмяСервера);
	Структура.Вставить("База"			,Объект.ИмяБазы);
	Структура.Вставить("Пользователь"	,Объект.ИмяПользователя);
	Структура.Вставить("Пароль"			,Объект.Пароль);

	Соединение = ОбщийМодульСервер.ПодключитьсяКбазе(Структура);
	
	Если Не Соединение = Неопределено Тогда 
		Для Каждого Метаданное Из Соединение.Метаданные.Catalogs Цикл 
			//НовСтрока = Объект.АС_Объекты.Добавить();
			//НовСтрока.АС_Имя 		= Метаданное.Имя;
			//НовСтрока.АС_Синоним 	= Метаданное.Синоним;  
			//НовСтрока.АС_Объект 	= Справочники.АС_Объекты.НайтиПоНаименованию(Метаданное.Синоним); //!! искать Вид + Наименование
			//Если ЗначениеЗаполнено(НовСтрока.АС_Объект) Тогда 
			//	НовСтрока.АС_ВидОбъекта = НовСтрока.АС_Объект.Вид;
			//	НовСтрока.АС_Подсистема = НовСтрока.АС_Объект.Подсистема; 
			//	НовСтрока.Изменен 		= НовСтрока.АС_Объект.Изменен;
			//КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры
