
&НаСервере 
//Определяем название и версию программы
//Соединение - СОМ соединение, параметры для подключения берутся из текущего эл. справочника 
//
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКТекущейбазе(Объект.Ссылка); 
	
	Если Не Соединение = Неопределено Тогда 
		 Объект.НазваниеВерсияКонфигурации =  Соединение.Метаданные.BriefInformation + " " + Соединение.Метаданные.Version;
	 КонецЕсли;	
	 
КонецПроцедуры

&НаКлиенте   
//Команда Обновить версию  
//
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере   
//Заполняем объектами ТЧ Метаданные 
//Соединение  - СОМ соединение, параметры для подключения берутся из текущего эл. справочника
//
Процедура КомандаЗаполнитьНаСервере()
	Объект.рс_Метаданные.Очистить();
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКТекущейбазе(Объект.Ссылка); 

	Если Не Соединение = Неопределено Тогда 
		 ЗаполнитьВидОбъекта(Соединение, "Catalogs");
		 //Соединение.Метаданные.Documents
		 //Соединение.Метаданные.AccumulationRegisters 
		 //Соединение.Метаданные.CommonCommands   
		 //Соединение.Метаданные.CommonForms
		 //Соединение.Метаданные.CommonModules  
		 //Соединение.Метаданные.CommonPictures
		 //Соединение.Метаданные.Constants  
		 //Соединение.Метаданные.DataProcessors
		 //Соединение.Метаданные.DefinedTypes  
		 //Соединение.Метаданные.DocumentJournals 
		 //Соединение.Метаданные.Enums  
		 //Соединение.Метаданные.EventSubscriptions
		 //
		 //Соединение.Метаданные.BusinessProcesses  
		 //Соединение.Метаданные.ChartsOfCharacteristicTypes
		 //Соединение.Метаданные.CommandGroups 
		 //Соединение.Метаданные.CommonAttributes  
		 //Соединение.Метаданные.ExchangePlans		 
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
//Заполним Справочниками из ИБ 
//Соединение - СОМ подключение
//Вид - Справочник_СОМ (Catalogs), Документ_СОМ (Documents) и д.р
//
Процедура ЗаполнитьВидОбъекта(Соединение, Вид)
	Для Каждого Метаданное Из Соединение.Метаданные[Вид] Цикл 
		НовСтрока = Объект.рс_Метаданные.Добавить();
		НовСтрока.рс_Имя 		= Метаданное.Имя;
		НовСтрока.рс_Синоним 	= Метаданное.Синоним; 
		НовСтрока.рс_ВидОбъекта = Перечисления.рс_ВидОбъектов.Справочники;		
		НовСтрока.рс_Объект 	= ОбщийМодульСервер.НайтиОбъект(Вид, Метаданное.Синоним); 
		
		Если ЗначениеЗаполнено(НовСтрока.рс_Объект) Тогда 
			НовСтрока.рс_Подсистема = НовСтрока.рс_Объект.Подсистема; 
			НовСтрока.Изменен 		= НовСтрока.рс_Объект.Изменен;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
//КомандаЗаполнить
//
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере 
//Добавляем эл. спр. Объекты
//Структура "Индентификатор", Имя);
//Структура "Наименование"	, Синоним);
//Структура "Вид"			, ВидОбъекта);
//Структура "Подсистема" 	, Подсистема);
//Соединение  - СОМ соединение
//
Функция СоздатьОбъектНаСервере(Структура)
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКТекущейбазе(Объект.Ссылка); 
	
	Структура.Вставить("ИнформационнаяБаза"	, Соединение);
	Структура.Вставить("СправочникИБ"		, Объект.Ссылка);
	
	Возврат ОбщийМодульСервер.СоздатьОбъект(Структура);   	
	
КонецФункции

&НаКлиенте
Процедура КомандаСоздатьОбъект(Команда)
		
	ТекСтрока = Элементы.рс_Метаданные.ТекущиеДанные;
	
	Структура = Новый Структура;
	Если ЗначениеЗаполнено(ТекСтрока.рс_Объект) = Ложь Тогда 
		Структура.Вставить("Индентификатор"	, ТекСтрока.рс_Имя);
		Структура.Вставить("Наименование"	, ТекСтрока.рс_Синоним);
		Структура.Вставить("Вид"			, ТекСтрока.рс_ВидОбъекта);
		Структура.Вставить("Подсистема" 	, ТекСтрока.рс_Подсистема);
				
		 рс_Объект = СоздатьОбъектНаСервере(Структура);
		 
	КонецЕсли; 
	
КонецПроцедуры
