
&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Структура = Новый Структура;
	Структура.Вставить("Сервер"			,Объект.ИмяСервера);
	Структура.Вставить("База"			,Объект.ИмяБазы);
	Структура.Вставить("Пользователь"	,Объект.ИмяПользователя);
	Структура.Вставить("Пароль"			,Объект.Пароль);
	
	Соединение = ОбщийМодульСервер.ПодключитьсяКбазе(Структура);    
	Если Не Соединение = Неопределено Тогда 
		 Объект.НазваниеВерсияКонфигурации =  Соединение.Метаданные.BriefInformation + " " + Соединение.Метаданные.Version;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры
